/**
 * Created by Administrator on 2017/10/19.
 */
import React from "react";
import  './register.less';
const Agreement = (()=>{


    return (
        <div className="agreementContent">
            <h2>宝达易购用户注册服务协议</h2>
            <p>欢迎您使用宝达易购平台服务！</p>
            <h3>特别提示：<br/>
                在使用宝达易购平台服务之前，您应当认真阅读并遵守《宝达易购服务协议》（以下简称“本协议”），请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款。免除或者限制责任的条款可能将以加粗字体显示，您应重点阅读。如您对协议有任何疑问的，应向宝达易购客服咨询。<br/><br/>
                当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他宝达易购允许的方式实际使用宝达易购平台服务时，即表示您已充分阅读、理解并接受本协议的全部内容，并与宝达易购平台达成协议。您承诺接受并遵守本协议的约定， 届时您不应以未阅读本协议的内容或者未获得宝达易购对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</h3>
            <h3>一、 协议范围</h3>
            <p>1、本协议由您与宝达易购平台的经营者共同缔结，本协议具有合同效力。
                宝达易购平台的经营者是指法律认可的经营宝达易购平台网站的责任主体，宝达易购平台网站包括但不限于宝达易购网（域名为 bdvending.com）、赛耀网络（域名为 saiyaoyun.com），本协议项下各宝达易购平台的经营者可单称或合称为“宝达易购”。有关宝达易购平台经营者的信息请查看各宝达易购平台首页底部公布的公司信息和证照信息。<br/><br/>

                2、除另行明确声明外，宝达易购平台服务包含任何宝达易购及其关联公司提供的基于互联网以及移动网的相关服务，且均受本协议约束。如果您不同意本协议的约定，您应立即停止注册/激活程序或停止使用宝达易购平台服务。<br/><br/>

                3、本协议内容包括协议正文、 法律声明、《宝达易购规则》及所有宝达易购已经发布或将来可能发布的各类规则、公告或通知（以下合称“宝达易购规则”或“规则”）。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。<br/><br/>

                4、宝达易购有权根据需要不时地制订、修改本协议及/或各类规则，并以网站公示的方式进行变更公告，无需另行单独通知您。变更后的协议和规则一经在网站公布后，立即或在公告明确的特定时间自动生效。若您在前述变更公告后继续使用宝达易购平台服务的，即表示您已经阅读、理解并接受经修订的协议和规则。若您不同意相关变更，应当立即停止使用宝达易购平台服务。</p>
            <h3>二、 注册与账户</h3>
            <p>1、主体资格<br/><br/>

                您确认，在您完成注册程序或以其他宝达易购允许的方式实际使用宝达易购平台服务时，<b>您应当是具备完全民事行为能权利能力和完全民事力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且宝达易购有权注销或永久冻结您的账户，并向您及您的监护人索偿相应损失。</b><br/><br/>
                2、注册和账户<br/><br/>

                a）当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他宝达易购允许的方式实际使用宝达易购平台服务时，您即受本协议约束。您可以使用您提供或确认的邮箱、手机号码或者宝达易购允许的其它方式作为登录手段进入宝达易购平台。<br/><br/>

                b）您了解并同意，如您在宝达易购平台注册成功，您即可以同步获得宝达易购登录名。您可以通过您的宝达易购登录名直接登录宝达集团旗下的其他任意一家网站，包括宝达易购以及后续可能开通的其他网站/服务（以下合称“宝达网站”），而无需重新注册。但如您已于2017年10月19日前注册成功，或者您注册时所使用的邮箱或手机号码已在宝达网站注册或使用的，则您的上述宝达易购录名的功能不默认立即开通。您在此明确授权，您的账户注册信息在您通过宝达易购平台注册成功时，已授权宝达易购披露给所有宝达网站并同时授权宝达网站使用，以使您更便捷地使用宝达网站服务。<br/><br/>

                c）您可以对账户设置宝达易购昵称，您也可以通过该宝达易购昵称和宝达易购登录名密码登录宝达易购平台。您设置的宝达易购昵称不得侵犯或涉嫌侵犯他人合法权益。如您设置的宝达易购昵称涉嫌侵犯他人合法权益，宝达易购有权终止向您提供宝达易购平台服务，注销您的宝达易购昵称。宝达易购昵称被注销后将开放给任意用户注册。<br/><br/>

                d）您的登录名、宝达易购昵称和密码不得以任何方式买卖、转让、赠与或继承，除非有法律明确规定或司法裁定，并经宝达易购同意，且需提供宝达易购要求的合格的文件材料并根据宝达易购制定的操作流程办理。<br/><br/>

                3、用户信息<br/><br/>

                a）在注册或激活流程时，您应当依照法律法规要求，按相应页面的提示准确提供您的资料，并于资料信息变更时及时更新，以保证您所提交资料的真实、及时、完整和准确。<b>如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，宝达易购有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部宝达易购平台服务。宝达易购对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。</b><br/><br/>

                <b> b）您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便宝达易购或其他用户与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用宝达易购平台服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持你提供的联系方式的真实性和有效性，如有变更或需要更新的，您应按宝达易购的要求进行操作。</b><br/><br/>

                4、账户安全<br/><br/>

                您须自行负责对您的宝达易购登录名、宝达易购昵称和密码保密，且须对您在该登录名、宝达易购昵称和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。您同意：(a) 如发现任何人未经授权使用您的宝达易购登录名、宝达易购昵称和密码，或发生违反保密规定的任何其他情况，您会立即通知宝达易购，并授权宝达易购将该信息同步给宝达网站；及 (b) 确保您在每个上网时段结束时，以正确步骤离开网站/服务。宝达易购不能也不会对因您未能遵守本款规定而发生的任何损失负责。您理解宝达易购对您的请求采取行动需要合理时间，宝达易购对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。<br/><br/>

                <b>5、宝达易购登录名注销<br/><br/>

                a）如您连续12个月未使用您的邮箱、手机或宝达易购认可的其他方式和密码登录过宝达易购平台，也未登录过其他任意宝达网站，且您的账户下不存在未到期的有效业务，您的宝达易购登录名可能被注销，不能再登录任意一家宝达网站，所有宝达网站服务同时终止。<br/><br/>

                    b）您同意并授权宝达网站，您如在任意宝达网站有欺诈、发布或销售假冒伪劣/侵权商品、侵犯他人合法权益或其他违反法律法规、宝达网站规则等行为，该网站在宝达网站的范围内对此有权披露，您的宝达易购登录名可能被注销、不能再登录任意一家宝达网站，所有宝达网站服务同时终止。<br/><br/></b>

            </p>
            <h3>三、 宝达易购平台服务</h3>
            <p>1、通过宝达易购及其关联公司提供的宝达易购平台服务和其它服务，会员可在宝达易购平台上创建店铺、发布交易信息、查询商品和服务信息、达成交易意向并进行交易、对其他会员进行评价、参加宝达易购组织的活动以及使用其它信息服务及技术服务，具体以所开通的平台提供的服务内容为准。<br/><br/>

                <b> 2、您在宝达易购平台上交易过程中与其他会员发生交易纠纷时，一旦您或其它会员任一方或双方共同提交宝达易购要求调处，则宝达易购作为独立第三方，有权根据单方判断做出调处决定，您了解并同意接受宝达易购的判断和调处决定。<br/><br/>

                    3、您了解并同意，宝达易购有权应政府部门（包括司法及行政部门）的要求，向其提供您向宝达易购提供的用户信息和交易记录等必要信息。如您涉嫌侵犯他人知识产权等合法权益，则宝达易购亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。<br/><br/></b>

                4、您在使用宝达易购平台服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由您独自承担。</p>
            <h3>四、宝达易购平台服务使用规范</h3>
            <p><b>1、在宝达易购平台上使用宝达易购服务过程中，您承诺遵守以下约定：<br/><br/>

                a)实施的所有行为均遵守国家法律、法规等规范性文件及宝达易购平台各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不偷逃应缴税费，不违反本协议及相关规则。</b><br/><br/>

                b)在与其他会员交易过程中，遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。<br/><br/>

                c)不发布国家禁止销售的或限制销售的商品或服务信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的商品或服务信息，不发布违背社会公共利益或公共道德或宝达易购认为不适合在宝达易购平台上销售的商品或服务信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。<br/><br/>

                d)不以虚构或歪曲事实的方式不当评价其他会员，不采取不正当方式制造或提高自身的信用度，不采取不正当方式制造或提高（降低）其他会员的信用度。<br/><br/>

                e)不对宝达易购平台上的任何数据作商业性利用，包括但不限于在未经宝达易购事先书面同意的情况下，以复制、传播等任何方式使用宝达易购平台站上展示的资料。<br/><br/>

                f)不使用任何装置、软件或例行程序干预或试图干预宝达易购平台的正常运作或正在宝达易购平台上进行的任何交易、活动。您不得采取任何将导致不合理的庞大数据负载加诸宝达易购平台网络设备的行动。<br/><br/>

                2、您了解并同意：<br/><br/>

                <b>a)您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保宝达易购免于因此产生任何损失或增加费用。<br/><br/>

                b)基于维护宝达易购平台交易秩序及交易安全的需要，宝达易购有权在发生恶意购买等扰乱市场正常交易秩序的情形下，执行关闭相应交易订单等操作。<br/><br/>

                c)经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者宝达易购根据自身的判断，认为您的行为涉嫌违反法律法规的规定或涉嫌违反本协议和/或规则的条款的，则宝达易购有权在宝达易购平台上公示您的该等涉嫌违法或违约行为及宝达易购已对您采取的措施。<br/><br/>

                d)对于您在宝达易购平台上发布的涉嫌违法、涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，宝达易购有权不经通知您即予以删除，且按照规则的规定进行处罚。<br/><br/>

                    e)对于您违反本协议项下承诺，或您在宝达易购平台上实施的行为，包括您未在宝达易购平台上实施但已经对宝达易购平台及其用户产生影响的行为，宝达易购有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。<br/><br/></b>

                f)如您涉嫌违反有关法律或者本协议之规定，使宝达易购遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿宝达易购因此造成的损失和/或发生的费用，包括合理的律师费用。</p>
            <h3>五、特别授权</h3>
            <p><b>您完全理解并不可撤销地授予宝达易购及其关联公司下列权利：<br/><br/>

                1、您完全理解并不可撤销地授权宝达易购或宝达易购授权的第三方或您与宝达易购一致同意的第三方，根据本协议及宝达易购规则的规定，处理您在宝达易购平台上发生的所有交易及可能产生的交易纠纷。您同意接受宝达易购或宝达易购授权的第三方或您与宝达易购一致同意的第三方的判断和调处决定。该决定将对您具有法律约束力。<br/><br/>

                2、一旦您向宝达易购、宝达易购和/或其关联公司，包括但不限于宝达易购等作出任何形式的承诺，且相关公司已确认您违反了该承诺，则宝达易购有权立即按您的承诺或协议约定的方式对您的账户采取限制措施，包括中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，宝达易购无须就相关确认与您核对事实，或另行征得您的同意，且宝达易购无须就此限制措施或公示行为向您承担任何的责任。<br/><br/>

                3、一旦您违反本协议，或与宝达易购签订的其他协议的约定，宝达易购有权以任何方式通知宝达易购关联公司和宝达易购，要求其对您的权益采取限制措施，包括但不限于要求宝达易购公司将您账户内的款项支付给宝达易购指定的对象，要求宝达易购和宝达易购关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。<br/><br/>

                4、对于您提供的资料及数据信息，您授予宝达易购、宝达易购及其关联公司独家的、全球通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)。此外，宝达易购、宝达易购及其关联公司有权(全部或部份地) 使用、复制、修订、改写、发布、翻译、分发、执行和展示您的全部资料数据（包括但不限于注册资料、交易行为数据及全部展示于宝达易购平台的各类信息）或制作其派生作品，并以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。<br/><br/>

                5、为方便您使用宝达易购平台服务及宝达网站或其他组织的服务（以下称其他服务），您同意并授权宝达易购将您在账户注册/激活、使用宝达易购平台服务过程中提供、形成的信息传递给向您提供其他服务的宝达网站或其他组织，或从提供其他服务的宝达网站或其他组织获取您在注册/激活、使用其他服务期间提供、形成的信息。您同意不会因此追究宝达易购、宝达集团旗下公司以及各家宝达网站的责任。</b></p>
            <h3>六、责任范围和责任限制</h3>
            <p><b>1、宝达易购负责按"现状"和"可得到"的状态向您提供宝达易购平台服务。但宝达易购对宝达易购平台服务不作任何明示或暗示的保证，包括但不限于宝达易购平台服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，宝达易购也不对宝达易购平台服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性作出任何承诺和保证。<br/><br/>

                2、您了解宝达易购平台上的信息系用户自行发布，且可能存在风险和瑕疵。宝达易购平台仅作为交易地点。宝达易购平台仅作为您获取物品或服务信息、物色交易对象、就物品和/或服务的交易进行协商及开展交易的场所，但宝达易购无法控制交易所涉及的物品的质量、安全或合法性，商贸信息的真实性或准确性，以及交易各方履行其在贸易协议中各项义务的能力。您应自行谨慎判断确定相关物品及/或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。<br/><br/>

                3、除非法律法规明确要求，或出现以下情况，否则，宝达易购没有义务对所有用户的信息数据、商品和服务信息、交易行为以及与交易有关的其它事项进行事先审查：<br/><br/>

                a)宝达易购有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形。<br/><br/>

                b)宝达易购有合理的理由认为用户在宝达易购平台的行为涉嫌违法或不当。<br/><br/>

                4、宝达易购或宝达易购授权的第三方或您与宝达易购一致同意的第三方有权基于您不可撤销得授权受理您与其他会员因交易产生的争议，并有权单方判断与该争议相关的事实及应适用的规则，进而作出处理决定，包括但不限于调整相关订单的交易状态，指令宝达易购公司将争议货款的全部或部分支付给交易一方或双方。该处理决定对您有约束力。如您未在限期内执行处理决定的，则宝达易购有权利（但无义务）直接使用您宝达易购账户内的款项，或您向宝达易购及其关联公司交纳的保证金代为支付。您应及时补足保证金并弥补宝达易购及其关联公司的损失，否则宝达易购及其关联公司有权直接抵减您在其它合同项下的权益，并有权继续追偿。</b><br/><br/>

                您理解并同意，宝达易购或宝达易购授权的第三方或您与宝达易购一致同意的第三方并非司法机构，仅能以普通人的身份对证据进行鉴别，宝达易购或宝达易购授权的第三方或您与宝达易购一致同意的第三方对争议的调处完全是基于您不可撤销得授权，其无法保证争议处理结果符合您的期望，也不对争议调处结论承担任何责任。如您因此遭受损失，您同意自行向受益人索偿。<br/><br/>

            <b> 5、您了解并同意，宝达易购不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (无论宝达易购是否已被告知该等损害赔偿的可能性) ：<br/><br/>

                a)使用或未能使用宝达易购平台服务。<br/><br/>

                b)第三方未经批准的使用您的账户或更改您的数据。<br/><br/>

                c)通过宝达易购平台服务购买或获取任何商品、样品、数据、信息或进行交易等行为或替代行为产生的费用及损失。<br/><br/>

                d)您对宝达易购平台服务的误解。<br/><br/>

                e)任何非因宝达易购的原因而引起的与宝达易购平台服务有关的其它损失。

                6、不论在何种情况下，宝达易购均不对由于信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。 </b></p>
            <h3>七、协议终止</h3>
            <p> <b>1、您同意，宝达易购有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部宝达易购平台服务，暂时冻结或永久冻结（注销）您的账户在宝达易购平台的权限，且无须为此向您或任何第三方承担任何责任。<br/><br/>

                2、出现以下情况时，宝达易购有权直接以注销账户的方式终止本协议，并有权永久冻结（注销）您的账户在宝达易购平台的权限和收回账户对应的宝达易购昵称：<br/><br/>

                a)宝达易购终止向您提供服务后，您涉嫌再一次直接或间接以他人名义注册为宝达易购用户的；<br/><br/>

                b)您提供的电子邮箱不存在或无法接收电子邮件，且没有其他方式可以与您进行联系，或宝达易购以其它联系方式通知您更改电子邮件信息，而您在宝达易购通知后三个工作日内仍未更改为有效的电子邮箱的。<br/><br/>

                c)您提供的用户信息中的主要内容不真实或不准确或不及时或不完整；<br/><br/>

                d)本协议（含规则）变更时，您明示并通知宝达易购不愿接受新的服务协议的；<br/><br/>

                e)其它宝达易购认为应当终止服务的情况。<br/><br/>

                3、您的账户服务被终止或者账户在宝达易购平台的权限被永久冻结（注销）后，</b>宝达易购没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。<br/><br/>

                4、您同意，您与宝达易购的合同关系终止后，宝达易购仍享有下列权利：<br/><br/>

                a）继续保存您的用户信息及您使用宝达易购平台服务期间的所有交易信息。<br/><br/>

                b)您在使用宝达易购平台服务期间存在违法行为或违反本协议和/或规则的行为的，宝达易购仍可依据本协议向您主张权利。<br/><br/>

                5、宝达易购中止或终止向您提供宝达易购平台服务后，对于您在服务中止或终止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保宝达易购免于因此产生任何损失或承担任何费用：<br/><br/>

                a)您在服务中止或终止之前已经上传至宝达易购平台的商品或服务尚未交易的，宝达易购有权在中止或终止服务的同时删除此项商品或服务的相关信息；<br/><br/>

                b)您在服务中止或终止之前已经与其他会员达成买卖合同，但合同尚未实际履行的，宝达易购有权删除该买卖合同及其交易商品或服务的相关信息；<br/><br/>

                c)您在服务中止或终止之前已经与其他会员达成买卖合同且已部分履行的，宝达易购可以不删除该项交易，但宝达易购有权在中止或终止服务的同时将相关情形通知您的交易对方。</p>
            <h3>八、隐私权政策</h3>
            <p>宝达易购将在宝达易购平台公布并不时修订隐私权政策，隐私权政策构成本协议的有效组成部分。</p>
            <h3>九、法律适用、管辖与其他</h3>
            <p>1、本协议之效力、解释、变更、执行与争议解决 <b>均适用中华人民共和国大陆地区法律</b>，如无相关法律规定的，则应参照通用国际商业惯例和/或行业惯例。<br/><br/>

                2、本协议包含了您使用各家宝达易购平台需遵守的一般性规范，您在使用某个宝达易购平台时还需遵守适用于该平台的特殊性规范（具体请参见您与该平台签署的其他协议以及平台规则等内容）。一般性规范如与特殊性规范不一致或有冲突，则特殊性规范具有优先效力。<br/><br/>

                3、因本协议产生之争议需根据您使用的服务归属的平台确定具体的争议对象，例如因您使用宝达易购服务所产生的争议应由宝达易购的经营者与您沟通并处理。 <b>一旦产生争议，您与宝达易购平台的经营者均同意以被告住所地人民法院为第一审管辖法院。</b><br/><br/>

                4、如本协议的中文版本和英文版本内容产生冲突，有其他语言版本，将以中文版本内容为准。本协议以其中文版本为最终生效版本。
            </p>
        </div>
    )
})
export default Agreement